# ========================================================================================#
# fpsa_2_1.yaml  ―  모델 구조 요약 
# ========================================================================================#
# fpsa_2_1 + phase info (fpsa_1_2)
# ========================================================================================#

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  #s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  #m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  #l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  #x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  # 0) RGB 그대로 pass → Identity (3ch)
  - [-1, 1, nn.Identity, []] # 0

  ## low, mid, high frequency ifft featuremap 획득
  - [ 0, 1, PhaseIFFTStack, [3, 0.1, 1.0, False] ] #1 result -> band pass 활용해 3채널로 출력 idx[low, mid, high]: 한번의 fft만 적용하기 위해
  
  ## high freq ifft featuremap 처리
  - [ 1, 1, ChSelect, [1, 1] ] # 2: arg[cout, featuremap index=2=high]
  - [-1, 1, nn.AvgPool2d, [8, 8]] # 3: 평균값 기반 다운샘플링-> 8커널 8stride avg pooling -> 640x640x1 -> 80x80x1
  - [-1, 1, Conv, [512, 1, 1]]  # 4: out_channels=512, kernel_size=1, stride=1 -> 80x80x512
  - [-1, 1, nn.Sigmoid, []] # 5: sigmoid -> attention mask

  ## low freq ifft featuremap 처리
  - [ 1, 1, ChSelect, [1, 0] ] # 6: arg[cout, featuremap index=1=mid]
  - [-1, 1, nn.AvgPool2d, [16, 16]] # 7: 평균값 기반 다운샘플링-> 16커널 16stride avg pooling -> 640x640x1 -> 40x40x1
  - [-1, 1, Conv, [512, 1, 1]]  # 8: out_channels=512, kernel_size=1, stride=1 -> 40x40x512
  - [-1, 1, nn.Sigmoid, []] # 9: sigmoid -> attention mask

  # ## low freq ifft featuremap 처리
  # - [ 1, 1, ChSelect, [1, 0] ] # 10: arg[cout, featuremap index=0=low]
  # - [-1, 1, nn.AvgPool2d, [32, 32]] # 11: 평균값 기반 다운샘플링-> 32커널 32stride avg pooling -> 640x640x1 -> 20x20x1
  # - [-1, 1, Conv, [1024, 1, 1]]  # 12: out_channels=1024, kernel_size=1, stride=1 -> 20x20x1024
  # - [-1, 1, nn.Sigmoid, []] # 13: sigmoid -> attention mask

  ## 정리 ## 
  # 5: high attention mask
  # 9: mid attention mask
  # 13: low attention mask

  ## RGB YOLO11 backbone ##
  - [0, 1, Conv, [64, 3, 2]]                   # 10 14
  - [-1, 1, Conv, [128, 3, 2]]                 # 11 15
  - [-1, 2, C3k2, [256, False, 0.25]]          # 12: P2 16

  - [-1, 1, Conv, [256, 3, 2]]                 # 13 17
  - [-1, 2, C3k2, [512, False, 0.25]]          # 14: P3 80x80x512 18
  - [[14, 5], 1, GatedAdd, [0]]                # 15: Fused P3 19

  - [-1, 1, Conv, [512, 3, 2]]                 # 16 20
  - [-1, 2, C3k2, [512, True]]                 # 17: P4 40x40x512 21
  - [[17, 9], 1, GatedAdd, [0]]                # 18: Fused P4 22

  - [-1, 1, Conv, [1024, 3, 2]]                # 19 23
  - [-1, 2, C3k2, [1024, True]]                # 20 24: P5 20x20x1024

  - [-1, 1, SPPF, [1024, 5]]                   # 21 19 26

  - [-1, 2, C2PSA, [1024]]                     # 22 27 25 32



head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 23 28 26 33: upsample fused P5
  - [[-1, 18], 1, Concat, [1]]                    # 24 29 27 34
  - [-1, 2, C3k2, [512, False]]                   # 25 30 28 35

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 26 31 29 36
  - [[-1, 15], 1, Concat, [1]]                    # 27 32 30 37
  - [-1, 2, C3k2, [256, False]]                   # 28 33 31 38 (final P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                    # 29 34 32 39
  - [[-1, 25], 1, Concat, [1]]                    # 30 35 33 40
  - [-1, 2, C3k2, [512, False]]                   # 31 36 34 41 (final P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                    # 32 35 42
  - [[-1, 22], 1, Concat, [1]]                    # 33 36 43
  - [-1, 2, C3k2, [1024, True]]                   # 34 37 44 (final P5/32-large)

  - [[28, 31, 34], 1, Detect, [nc]]              # 35 45
